/* eslint-disable quotes,@typescript-eslint/quotes */
export interface RulesPost {
    date: number
    author: string
    title: string
    content: string
    longContent?: string
}

export const rules: RulesPost[] = [
    {
        date: 1690908230000,
        author: "Katloo",
        title: "விதிமுறைகள்",
        content: `இந்த விளையாட்டை விளையாடுவதன் மூலம் நீங்கள் விதிமுறைகளை ஏற்றுக்கொள்கிறீர்கள். விதிமுறைகளை மீறுவது தடைக்கு வழிவகுக்கும்.`,
        longContent: `<ul>
  <li><strong>ஒற்றை வீரர் முறையில் குழு சேர்தல் கூடாது.</strong> ஒற்றை வீரர்களோடு அதிக நேரத்திற்கு சேர்ந்து விளையாட கூடாது.</li>
  <li><strong>ஹாக்கின்க் பண்ணக்கூடாது.</strong> ஸ்கிரிப்ட்ஸ், பிளகின், எக்ஸ்டென்ஷன், பயன்படுத்தி, எதிராளிகளை விட தனக்கு சாதகமாக விளையாட்டை மாற்றுவது முற்றிலும் தடை செய்யப்பட்டுள்ளது.</li>
  <li><strong>பொருத்தமில்லாத பயன்பட்ட பெயர்கள் வைத்திறுக்க கூடாது</strong> நம்மளோட தடைப் பட்டியல்கள் மிகவும் தளர்வானவாக இருக்கு. ஆனால் சில விஷயங்களுக்கு இன்னும் தடை விதிக்கப்பட்டிருக்கு. இந்த குறிப்பிட்ட வார்த்தைகளுக்கான வடிகட்டிகளை தாண்டி செயல்படப் பார்த்தீர்கள் என்றால், விளைவுகள் வரும். </li>
</ul>`
    },
    {
        date: 1690908230000,
        author: "Katloo",
        title: "பயிற்சி",
        content: `நீங்கள் இதற்கு புதியதாக இருந்தால், இதனை படித்து எவ்வாறு விளையாடனுமென்று கற்றுக்கொல்லலாம்`,
        longContent: `<h2>கட்டுப்பாட்டுகள்</h2>
<p>நகருவதற்கு - WASD அல்லது Arrow Keys</p>
<p>குறி - Mouse</p>
<p>தாக்குவதற்கு - Left-Click</p>
<p>துப்பாக்கியை மாற்றுவதற்கு- 1இல் இருந்து 3 வறை அல்லது Scroll Wheel</p>
<p>எடுப்பதற்கு\\பயன்படுத்துவதற்கு - F</p>
<p>ரீலோட் - R</p>
<p>மருந்துகளை பயன்படுத்துவதற்கு - மறுந்து காட்டியில் Left-Click அல்லது 7இல் இறுந்து 0 வறை</p>
<p>வேலை நிறுத்துவதற்கு - X</p>
<p>முழு வரைபடத்தை காண்பிக்க - G அல்லது M</p>
<p>சின்ன வரைபடத்தை காண்பிக்க - N</p>
<p>உணர்ச்சி சக்கரத்தை பயன்படுத்த - Right-Click, drag, பிறகு release</p>
<p>பொருளை விடுவதற்கு - Right-Click on item</p>
<p>கடைசியாக பயன்படுத்திய பொருளுக்கு மாற்ற - Q</p>
<p>துப்பாக்கி பிடிப்பை இடமாற்றுவதற்கு - T</p>
<p>வேறு துப்பாக்கிக்கு மாற்ற - Space</p>
<p>உருப்பெருக்கான் மாற்றுவதற்கு - உருப்பெருக்கான் காட்டியில் Left-Click </p>

<h3>விசைபினைப்புகள் அமைப்புகள் பக்கத்தில் மாற்றலாம்!</h3>

<h2>எவ்வாறு விளையாடுவது</h2>
<p>ஒரு சுற்றில் ஒருவரின் இலட்சியம் என்பது விளையாட்டிள் கடைசி வீரராக இருக்கவேண்டும். விளையாட்டிள் இரங்கும்போது எதுவும் இல்லாமல்தான் இரங்குவீர். அதனால் களத்திள் ஆங்காங்கு இருக்கும் துப்பாக்கிகள், உருப்பெருக்கான்கள், உடுப்புகள், மருந்துகள், மற்றும் அம்மோக்களை எடுத்துக்கொள்ளுங்கள். மற்றொரு வீரரை பாற்த்தால் அவரை கொண்று அவரின் பொருட்களை அடுக்களாம்!</p>

<h2>ஆரஞ்சு = கெட்டது</h2>
<p>மற்ற வீரர்கள் மட்டும் உன் எதிரியல்ல- ஒரு கொடிய ஆரஞ்சு வாயுவும் உள்ளது. இந்த வாயு களத்தை மெதுவாக ஆக்கிரமிக்கும், அதனால் மீதம் உள்ள பாதுகாப்பான மண்டலம் சிறிதாகிக்கொண்டே இருக்கும். பாதுகாப்பான மண்டலம் சுறுங்கச்சுறுங்க, வாயுவின் கொடிய-தன்மை அதிகரிக்கும்.</p>

<h2>Similar Games</h2>
<p>If you've played games like PUBG, Fortnite, and Apex Legends, or other browser battle royales like surviv.io and zombsroyale.io, you might be familiar with the concept of the game!</p>
`
    }
];
